# WoodPoreDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodPoreDepth Property
AdvancedWood Class See Also
---
The property labeled "Bump depth variation (cm) for pores" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodPoreDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodPoreDepth As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodPoreDepth {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDistance".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace